ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G430/N32G430.svd
                <register>
                    <name>CAN_F3B1</name>
                    <displayName>CAN_F3B1</displayName>
                    <description>CAN_F3B1</description>
                    <addressOffset>0x258</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F3B2</name>
                    <displayName>CAN_F3B2</displayName>
                    <description>CAN_F3B2</description>
                    <addressOffset>0x25C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F4B1</name>
                    <displayName>CAN_F4B1</displayName>
                    <description>CAN_F4B1</description>
                    <addressOffset>0x260</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F4B2</name>
                    <displayName>CAN_F4B2</displayName>
                    <description>CAN_F4B2</description>
                    <addressOffset>0x264</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F5B1</name>
                    <displayName>CAN_F5B1</displayName>
                    <description>CAN_F5B1</description>
                    <addressOffset>0x268</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F5B2</name>
                    <displayName>CAN_F5B2</displayName>
                    <description>CAN_F5B2</description>
                    <addressOffset>0x26C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F6B1</name>
                    <displayName>CAN_F6B1</displayName>
                    <description>CAN_F6B1</description>
                    <addressOffset>0x270</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F6B2</name>
                    <displayName>CAN_F6B2</displayName>
                    <description>CAN_F6B2</description>
                    <addressOffset>0x274</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F7B1</name>
                    <displayName>CAN_F7B1</displayName>
                    <description>CAN_F7B1</description>
                    <addressOffset>0x278</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F7B2</name>
                    <displayName>CAN_F7B2</displayName>
                    <description>CAN_F7B2</description>
                    <addressOffset>0x27C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F8B1</name>
                    <displayName>CAN_F8B1</displayName>
                    <description>CAN_F8B1</description>
                    <addressOffset>0x280</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F8B2</name>
                    <displayName>CAN_F8B2</displayName>
                    <description>CAN_F8B2</description>
                    <addressOffset>0x284</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F9B1</name>
                    <displayName>CAN_F9B1</displayName>
                    <description>CAN_F9B1</description>
                    <addressOffset>0x288</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F9B2</name>
                    <displayName>CAN_F9B2</displayName>
                    <description>CAN_F9B2</description>
                    <addressOffset>0x28C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F10B1</name>
                    <displayName>CAN_F10B1</displayName>
                    <description>CAN_F10B1</description>
                    <addressOffset>0x290</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F10B2</name>
                    <displayName>CAN_F10B2</displayName>
                    <description>CAN_F10B2</description>
                    <addressOffset>0x294</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F11B1</name>
                    <displayName>CAN_F11B1</displayName>
                    <description>CAN_F11B1</description>
                    <addressOffset>0x298</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F11B2</name>
                    <displayName>CAN_F11B2</displayName>
                    <description>CAN_F11B2</description>
                    <addressOffset>0x29C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F12B1</name>
                    <displayName>CAN_F12B1</displayName>
                    <description>CAN_F12B1</description>
                    <addressOffset>0x2a0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F12B2</name>
                    <displayName>CAN_F12B2</displayName>
                    <description>CAN_F12B2</description>
                    <addressOffset>0x2a4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F13B1</name>
                    <displayName>CAN_F13B1</displayName>
                    <description>CAN_F13B1</description>
                    <addressOffset>0x2a8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN_F13B2</name>
                    <displayName>CAN_F13B2</displayName>
                    <description>CAN_F13B2</description>
                    <addressOffset>0x2ac</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>FBC</name>
                            <description>FBC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
