ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G430/N32G430.svd
                <register>
                    <name>AFIO_EFT_CFG1</name>
                    <displayName>AFIO_EFT_CFG1</displayName>
                    <description>AFIO_EFT_CFG1</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PA0EFTEN</name>
                            <description>PA0EFTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA1EFTEN</name>
                            <description>PA1EFTEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA2EFTEN</name>
                            <description>PA2EFTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA3EFTEN</name>
                            <description>PA3EFTEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA4EFTEN</name>
                            <description>PA4EFTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA5EFTEN</name>
                            <description>PA5EFTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA6EFTEN</name>
                            <description>PA6EFTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA7EFTEN</name>
                            <description>PA7EFTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA8EFTEN</name>
                            <description>PA8EFTEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA9EFTEN</name>
                            <description>PA9EFTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA10EFTEN</name>
                            <description>PA10EFTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA11EFTEN</name>
                            <description>PA11EFTEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA12EFTEN</name>
                            <description>PA12EFTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA13EFTEN</name>
                            <description>PA13EFTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA14EFTEN</name>
                            <description>PA14EFTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA15EFTEN</name>
                            <description>PA15EFTEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB0EFTEN</name>
                            <description>PB0EFTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB1EFTEN</name>
                            <description>PB1EFTEN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB2EFTEN</name>
                            <description>PB2EFTEN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB3EFTEN</name>
                            <description>PB3EFTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB4EFTEN</name>
                            <description>PB4EFTEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB5EFTEN</name>
                            <description>PB5EFTEN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB6EFTEN</name>
                            <description>PB6EFTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB7EFTEN</name>
                            <description>PB7EFTEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB8EFTEN</name>
                            <description>PB8EFTEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB9EFTEN</name>
                            <description>PB9EFTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB10EFTEN</name>
                            <description>PB10EFTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB11EFTEN</name>
                            <description>PB11EFTEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB12EFTEN</name>
                            <description>PB12EFTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB13EFTEN</name>
                            <description>PB13EFTEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB14EFTEN</name>
                            <description>PB14EFTEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB15EFTEN</name>
                            <description>PB15EFTEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_EFT_CFG2</name>
                    <displayName>AFIO_EFT_CFG2</displayName>
                    <description>AFIO_EFT_CFG2</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xf001e000</resetMask>
                    <fields>
                        <field>
                            <name>PC13EFTEN</name>
                            <description>PC13EFTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC14EFTEN</name>
                            <description>PC14EFTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PC15EFTEN</name>
                            <description>PC15EFTEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD0EFTEN</name>
                            <description>PD0EFTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD12EFTEN</name>
                            <description>PD12EFTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD13EFTEN</name>
                            <description>PD13EFTEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD14EFTEN</name>
                            <description>PD14EFTEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD15EFTEN</name>
                            <description>PD15EFTEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_FILT_CFG</name>
                    <displayName>AFIO_FILT_CFG</displayName>
                    <description>AFIO_FILT_CFG</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001f</resetMask>
                    <fields>
                        <field>
                            <name>IOFILTCFG</name>
                            <description>IOFILTCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFIO_DIGEFT_CFG1</name>
                    <displayName>AFIO_DIGEFT_CFG1</displayName>
                    <description>AFIO_DIGEFT_CFG1</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>PA0DIGEFTEN</name>
                            <description>PA0DIGEFTEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA1DIGEFTEN</name>
                            <description>PA1DIGEFTEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA2DIGEFTEN</name>
                            <description>PA2DIGEFTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA3DIGEFTEN</name>
                            <description>PA3DIGEFTEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA4DIGEFTEN</name>
                            <description>PA4DIGEFTEN</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA5DIGEFTEN</name>
                            <description>PA5DIGEFTEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA6DIGEFTEN</name>
                            <description>PA6DIGEFTEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA7DIGEFTEN</name>
                            <description>PA7DIGEFTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA8DIGEFTEN</name>
                            <description>PA8DIGEFTEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA9DIGEFTEN</name>
                            <description>PA9DIGEFTEN</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA10DIGEFTEN</name>
                            <description>PA10DIGEFTEN</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA11DIGEFTEN</name>
                            <description>PA11DIGEFTEN</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA12DIGEFTEN</name>
                            <description>PA12DIGEFTEN</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA13DIGEFTEN</name>
                            <description>PA13DIGEFTEN</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PA14DIGEFTEN</name>
                            <description>PA14DIGEFTEN</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PA15DIGEFTEN</name>
                            <description>PA15DIGEFTEN</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB0DIGEFTEN</name>
                            <description>PB0DIGEFTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB1DIGEFTEN</name>
                            <description>PB1DIGEFTEN</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB2DIGEFTEN</name>
                            <description>PB2DIGEFTEN</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB3DIGEFTEN</name>
                            <description>PB3DIGEFTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB4DIGEFTEN</name>
                            <description>PB4DIGEFTEN</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB5DIGEFTEN</name>
                            <description>PB5DIGEFTEN</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB6DIGEFTEN</name>
                            <description>PB6DIGEFTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB7DIGEFTEN</name>
                            <description>PB7DIGEFTEN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB8DIGEFTEN</name>
                            <description>PB8DIGEFTEN</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
						<field>
                            <name>PB9DIGEFTEN</name>
                            <description>PB9DIGEFTEN</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB10DIGEFTEN</name>
                            <description>PB10DIGEFTEN</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB11DIGEFTEN</name>
                            <description>PB11DIGEFTEN</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB12DIGEFTEN</name>
                            <description>PB12DIGEFTEN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB13DIGEFTEN</name>
                            <description>PB13DIGEFTEN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB14DIGEFTEN</name>
                            <description>PB14DIGEFTEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB15DIGEFTEN</name>
                            <description>PB15DIGEFTEN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
