ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G430/N32G430.svd
                <register>
                    <name>I2C_TMRISE</name>
                    <displayName>I2C_TMRISE</displayName>
                    <description>I2C_TMRISE</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xfffe003f</resetMask>
                    <fields>
                        <field>
                            <name>TMRISE</name>
                            <description>TMRISE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>SDADFW</name>
                            <description>SDADFW</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SCLDFW</name>
                            <description>SCLDFW</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SDAAFW</name>
                            <description>SDAAFW</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SDAAFENN</name>
                            <description>SDAAFENN</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCLAFW</name>
                            <description>SCLAFW</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SCLAFENN</name>
                            <description>SCLAFENN</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="I2C1">
            <name>I2C2</name>
            <baseAddress>0x40005800</baseAddress>
            <interrupt>
                <name>I2C2_EV</name>
                <description>I2C2 Event interrupt</description>
                <value>32</value>
            </interrupt>
            <interrupt>
                <name>I2C2_ER</name>
                <description>I2C2 Error interrupt</description>
                <value>33</value>
            </interrupt> 			
		</peripheral>

        <peripheral>
            <name>IWDG</name>
            <description>Independent watchdog</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40003000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>IWDG_KEY</name>
                    <displayName>IWDG_KEY</displayName>
                    <description>IWDG_KEY</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000ffff</resetMask>
                    <fields>
                        <field>
                            <name>KEYV</name>
                            <description>KEYV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_PREDIV</name>
                    <displayName>IWDG_PREDIV</displayName>
                    <description>IWDG_PREDIV</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>PD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_RELV</name>
                    <displayName>IWDG_RELV</displayName>
                    <description>IWDG_RELV</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000fff</resetValue>
                    <resetMask>0x00000fff</resetMask>
                    <fields>
                        <field>
                            <name>REL</name>
                            <description>REL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IWDG_STS</name>
                    <displayName>IWDG_STS</displayName>
                    <description>IWDG_STS</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <description>PVU</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRVU</name>
                            <description>CRVU</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
