ruslanbd/geekvape-t200MOD/Common Platform_V1.0.6/Soft Development Platform/Nations Device PACK Add To IAR Tool V1.1.14/Nations Device PACK/debugger/Nations/N32G430/N32G430.svd
                <register>
                    <name>RTC_TMPCFG</name>
                    <displayName>RTC_TMPCFG</displayName>
                    <description>RTC_TMPCFG</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x002dff9f</resetMask>
                    <fields>
                        <field>
                            <name>TP1EN</name>
                            <description>TP1EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1TRG</name>
                            <description>TP1TRG</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPINTEN</name>
                            <description>TPINTEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2EN</name>
                            <description>TP2EN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2TRG</name>
                            <description>TP2TRG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3EN</name>
                            <description>TP3EN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3TRG</name>
                            <description>TP3TRG</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TPTS</name>
                            <description>TPTS</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TPFREQ</name>
                            <description>TPFREQ</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>	
                        <field>
                            <name>TPFLT</name>
                            <description>TPFLT</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>TPPRCH</name>
                            <description>TPPRCH</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>	
                        <field>
                            <name>TPPUDIS</name>
                            <description>TPPUDIS</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP1INTEN</name>
                            <description>TP1INTEN</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1NOE</name>
                            <description>TP1NOE</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TP1MF</name>
                            <description>TP1MF</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP2INTEN</name>
                            <description>TP2INTEN</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2NOE</name>
                            <description>TP2NOE</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TP2MF</name>
                            <description>TP2MF</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>	
                        <field>
                            <name>TP3INTEN</name>
                            <description>TP3INTEN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3NOE</name>
                            <description>TP3NOE</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                        <field>
                            <name>TP3MF</name>
                            <description>TP3MF</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>						
                    </fields>
                </register>				
                <register>
                    <name>RTC_ALRMASS</name>
                    <displayName>RTC_ALRMASS</displayName>
                    <description>RTC_ALRMASS</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0f007fff</resetMask>
                    <fields>
                        <field>
                            <name>SSV</name>
                            <description>SSV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>MASKSSB</name>
                            <description>MASKSSB</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_ALRMBSS</name>
                    <displayName>RTC_ALRMBSS</displayName>
                    <description>RTC_ALRMBSS</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0f007fff</resetMask>
                    <fields>
                        <field>
                            <name>SSV</name>
                            <description>SSV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                        <field>
                            <name>MASKSSB</name>
                            <description>MASKSSB</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_OPT</name>
                    <displayName>RTC_OPT</displayName>
                    <description>RTC_OPT</description>
                    <addressOffset>0x4c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>TYPE</name>
                            <description>TYPE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_BKP1</name>
                    <displayName>RTC_BKP1</displayName>
                    <description>RTC_BKP1</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP2</name>
                    <displayName>RTC_BKP2</displayName>
                    <description>RTC_BKP2</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP3</name>
                    <displayName>RTC_BKP3</displayName>
                    <description>RTC_BKP3</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
	            <register>
                    <name>RTC_BKP4</name>
                    <displayName>RTC_BKP4</displayName>
                    <description>RTC_BKP4</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>			
	            <register>
                    <name>RTC_BKP5</name>
                    <displayName>RTC_BKP5</displayName>
                    <description>RTC_BKP5</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP6</name>
                    <displayName>RTC_BKP6</displayName>
                    <description>RTC_BKP6</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP7</name>
                    <displayName>RTC_BKP7</displayName>
                    <description>RTC_BKP7</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP8</name>
                    <displayName>RTC_BKP8</displayName>
                    <description>RTC_BKP8</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
	            <register>
                    <name>RTC_BKP9</name>
                    <displayName>RTC_BKP9</displayName>
                    <description>RTC_BKP9</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP10</name>
                    <displayName>RTC_BKP10</displayName>
                    <description>RTC_BKP10</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
	            <register>
                    <name>RTC_BKP11</name>
                    <displayName>RTC_BKP11</displayName>
                    <description>RTC_BKP11</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP12</name>
                    <displayName>RTC_BKP12</displayName>
                    <description>RTC_BKP12</description>
                    <addressOffset>0x7c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP13</name>
                    <displayName>RTC_BKP13</displayName>
                    <description>RTC_BKP13</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP14</name>
                    <displayName>RTC_BKP14</displayName>
                    <description>RTC_BKP14</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>		
                <register>
                    <name>RTC_BKP15</name>
                    <displayName>RTC_BKP15</displayName>
                    <description>RTC_BKP15</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>			
                <register>
                    <name>RTC_BKP16</name>
                    <displayName>RTC_BKP16</displayName>
                    <description>RTC_BKP16</description>
                    <addressOffset>0x8c</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
                <register>
                    <name>RTC_BKP17</name>
                    <displayName>RTC_BKP17</displayName>
                    <description>RTC_BKP17</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BF</name>
                            <description>BF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>	
